Revit 2024 API
RebarUpdateCurvesData.IsStyleChanged Property
 Indicates if the style has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsStyleChanged { get; }
Visual Basic
Public ReadOnly Property IsStyleChanged As Boolean
	Get
Visual C++
public:
property bool IsStyleChanged {
	bool get ();
}
See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace